Dlubal.RFEM5.SurfaceAxesDirection
Direction of surface axes for input and results

Dlubal.RFEM5.SurfaceAxesDirection.UnknownSurfaceAxesDirection
Unknown axes direction

Dlubal.RFEM5.SurfaceAxesDirection.StandardSurfaceAxesDirection
Standard axes direction

Dlubal.RFEM5.SurfaceAxesDirection.IdenticalToAxesForInput
Identical to axes for input

Dlubal.RFEM5.SurfaceAxesDirection.SurfaceAngularRotation
Angular rotation

Dlubal.RFEM5.SurfaceAxesDirection.SurfaceAxisXParallelToLine
Axis x parallel to line

Dlubal.RFEM5.SurfaceAxesDirection.SurfaceAxisYParallelToLine
Axis y parallel to line

Dlubal.RFEM5.SurfaceAxesDirection.SurfaceAxisXDirectToPoint
Axis x direct to point

Dlubal.RFEM5.SurfaceAxesDirection.SurfaceAxisYDirectToPoint
Axis y direct to point

Dlubal.RFEM5.SurfaceAxesDirection.SurfaceAxesParallelToGlobalCS
Axes parallel to global coordinate system XYZ

Dlubal.RFEM5.SurfaceAxesDirection.SurfaceAxesParallelToUserCS
Axes parallel to user-defined coordinate system